app/views/bookings/_booking_search.html.haml

SELECT `bookings`.* FROM `bookings`  WHERE (checkin_date < '10/15/2015' and checkout_date > '10/14/2015')
---
        %label#room-option-label.bold Rooms:
        = select_tag "booking[room_count]", options_for_select((1..9).to_a, booking_params("room_count", 1))