app/views/bookings/show.html.haml

                      %ul
                        - @room_type.facilities.each do |facility|
---
SELECT `facilities`.* FROM `facilities` INNER JOIN `room_types_facilities` ON `facilities`.`id` = `room_types_facilities`.`facility_id` WHERE `room_types_facilities`.`room_type_id` = 3