app/views/rooms/_form.html.haml

    .controls
      = f.select :room_type_id, RoomType.all.collect{|r| [r.name, r.id]}, class: 'form-control', required: true
---
SELECT `room_types`.* FROM `room_types`