app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)
    @room_type = @booking.room_type
    if @booking.save
---
INSERT INTO `bookings` (`address_line1`, `address_line2`, `adult_count`, `checkin_date`, `checkout_date`, `city`, `country`, `created_at`, `email`, `first_name`, `last_name`, `night_count`, `payment_amount`, `phone_no`, `room_count`, `room_type_id`, `state`, `uid`, `updated_at`) VALUES ('Test', 'test', 1, '2015-10-14', '2015-10-15', 'test', 'test', '2015-10-14 12:32:47', 'pushpal.chavhan@gmail.com', 'Pushpalat', 'Chavhan', 1, 12000.0, '9876543210', 1, 3, 'test', 'B2DAH2HI91896A6', '2015-10-14 12:32:47')

  def show
    @booking = Booking.find(params[:id])
---
SELECT  `bookings`.* FROM `bookings`  WHERE `bookings`.`id` = 3 LIMIT 1