app/controllers/facilities_controller.rb

  def index
    @facilities = Facility.all
---
SELECT `facilities`.* FROM `facilities`