app/controllers/room_types_controller.rb

  def index
    @room_types = RoomType.all
---
SELECT `room_types`.* FROM `room_types`