app/controllers/rooms_controller.rb

  def index
    @rooms = Room.search(params)
---
SELECT `rooms`.* FROM `rooms`