app/controllers/tokens_controller.rb

  def create
    email = params[:email]
    password = params[:password]
    if request.format != :json
      render :status=>406, :json=>{:message=>"The request must be json"}
      return
    end

    if email.nil? or password.nil?
       render :status=>400,
              :json=>{:message=>"The request must contain the user email and password."}
       return
    end

    @user=User.find_by_email(email.downcase)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'test@gmail.com' LIMIT 1